[
  {
    "title": "Introduction",
    "body": [
      "Welcome to AI Food Recipe. By accessing or using our website, services, or AI chatbot, you agree to comply with and be bound by these Terms & Conditions. If you do not agree, please do not use our services."
    ]
  },
  {
    "title": "Services Provided",
    "body": [
      "Input ingredients manually or select from pre-suggested options.",
      "Receive AI-generated recipes instantly.",
      "Access subscription-only features (e.g., advanced recipe customization, calorie tracking).",
      "Recipes are for personal and non-commercial use only."
    ]
  },
  {
    "title": "User Accounts",
    "body": [
      "You must create an account to access some features (e.g., saving recipes, tracking preferences).",
      "You are responsible for maintaining the confidentiality of your login credentials.",
      "Misuse of your account will be considered a violation of these Terms."
    ]
  },
  {
    "title": "Subscription & Payments",
    "body": [
      "We offer Monthly and Yearly subscription plans.",
      "All payments are processed securely through our payment partners.",
      "Subscriptions renew automatically unless canceled before the renewal date.",
      "No refunds will be issued for partial subscription periods."
    ]
  },
  {
    "title": "Content & Usage",
    "body": [
      "Recipes generated by AI may not always be 100% accurate or safe for dietary restrictions — always verify before cooking.",
      "You may not copy, resell, or redistribute our recipes or chatbot responses without permission."
    ]
  },
  {
    "title": "Prohibited Activities",
    "body": [
      "Do not use the website for unlawful purposes.",
      "Do not input harmful, offensive, or misleading content into the chatbot.",
      "Do not attempt to hack or disrupt our services."
    ]
  },
  {
    "title": "Limitation of Liability",
    "body": [
      "We are not responsible for any food allergies, dietary issues, or cooking mishaps resulting from following our recipes.",
      "We are not responsible for service interruptions or data loss."
    ]
  },
  {
    "title": "Changes to Terms",
    "body": [
      "We may update these Terms from time to time. Updates will be posted on this page with the 'Last updated' date."
    ]
  },
  {
    "title": "Contact",
    "body": ["[Your email/contact form link]"]
  }
]
